age = int(input("19: "))
if age >= 18:
    print("თქვენ შეგიძლიათ მართოთ მანქანა.")
else:
    print("თქვენ არ შეგიძლიათ მართოთ მანქანა.")

# -----------------------------------------------

temperature = float(input("0: "))
if temperature >= 20:
    print("ამინდი თბილია.")
else:
    print("ამინდი ცივია.")

    # -----------------------------------------------

    bread_count = int(input("რამდენი პური გაქვს საკუჭნაოში? "))
if bread_count >= 1:
    print("არ არის საჭირო პურის ყიდვა.")
else:
    print("უნდა შეიძინო პური.")

    # -----------------------------------------------
    number = int(input("19: "))
if number % 2 == 0:
    print("ციფრი არის ლუწი.") 
else:
    print("ციფრი არის კენტი.")

