# 1)
# + გამოყენება შეკრებისთვის
# - გამოყენება გამოკლებისთვის
# * გამოყენება გამრავლებისთვის
# / გამოყენება გაყოფისთვის 
# // გამოყენება გაყოფისთვის 
# % გამოყენება ნაშთის მისაღებად
# ** გამოყენება ხარისხის ასაღებად 

# 2) 
რიცხვი = int(input("41: "))
რიცხვი1 = int(input("20: "))
sum = რიცხვი + რიცხვი1
print("ორ ციფრს შორის ჯამი არის:", sum)

# 3)

ათი = 10
სამი = 3

print("შეკრება:", ათი + სამი)       # 13
print("გამოკლება:", ათი - სამი)     # 7
print("გამრავლება:", ათი * სამი)    # 30
print("გაყოფა:", ათი / სამი)        # 3.333...
print("მთელი გაყოფა:", ათი // სამი) # 3
print("ნაშთი:", ათი % სამი)         # 1
print("ხარისხი:", ათი ** სამი)      # 1000

# 3)
ბურთები_ყუთში = 4
ბურთი = 3
total_balls = ბურთები_ყუთში * ბურთი
print("სულ ბურთების რაოდენობაა:", total_balls)

# 4)
რამდენი_წლის_ვარ_მე = 12
მამაჩემის_წლოვანება = 40

print("ვარ თუ არა მამისზე ახალგაზრდა?", რამდენი_წლის_ვარ_მე < მამაჩემის_წლოვანება)     # True
print("მამა ჩემს ტოლად არის?", რამდენი_წლის_ვარ_მე == მამაჩემის_წლოვანება)              # False
print("მამა ჩემზე უფროსია?", მამაჩემის_წლოვანება > რამდენი_წლის_ვარ_მე )                 # True
print("ჩემი და მამის ასაკი ერთნაირია?", რამდენი_წლის_ვარ_მე  == მამაჩემის_წლოვანება)     # False
print("ჩემი ასაკი არ უდრის მამისას?", რამდენი_წლის_ვარ_მე  != მამაჩემის_წლოვანება)       # True
print("მამა არ არის ჩემზე უფროსი?", მამაჩემის_წლოვანება <= რამდენი_წლის_ვარ_მე )         # False