# Python-ის საფუძვლები
# გავეცანით ციკლებს, კონკრეტულად while loop-ს, სიებს (lists) და ინდექსაციას
# ვისწავლეთ ელემენტების გამოტანა სიიდან კონკრეტული ადგილიდან
# განვიხილეთ განსხვავება ცვლადსა და სიას შორის
# დავწერეთ პროგრამა, რომელიც ითვლის რიცხვების ჯამს, რომლებიც მომხმარებელმა შეიყვანა

i = 4
while i <= 84:
    if i != 6:  
        print(i)
    i += 1  
# -----------------------------

my_list = [10, 20, 30, 40, 50, 60, 70]
print("მე-2 ელემენტი:", my_list[1])
print("მე-4 ელემენტი:", my_list[3])
print("მე-6 ელემენტი:", my_list[5])

# ------------------------------
x = 10  
my_list = [10, 20, 30]  
print(my_list[0])  

