# 1)
name  = "ლუკა"
birthday = 2015

print ("მოგესალმებით" , name , "დაბადების დღე გაქვს" , birthday)

# ლუკას აკლია "
# birthday > 2015 ara birthday = 2015
# კიდე Name არ უნდა იყოს უნდა იყოს name როგორცი ცვლადი არის დაწერილი
# დაბადების დღე გაქვს" აკლია " უნდა იყოს ესე "დაბადების დღე გაქვს"

# 2)
score = 120
print("მოთამაშეს ქულა:" , score)

# 3)
health = 3
print("მოთამაშის სიცოცხლე:" , health)

# 4)
dad = "თორნიკე ჩაგელიშვილი"
mom = "აზა ლოდია"
sister = "ელენე ჩაგელიშვილი"

print("მამა:" , dad)
print("დედა:" , mom)
print("და:" , sister)

# 5)
name = "ნიკოლოზი"
surname = "ჩაგელიშვილი"

full_name = name + " " + surname
print("სრული სახელი:", full_name)

# 6)
# მე ამ გაკვეთილზე ვისწავლე ცვლადები რაც ინახავს ნიშვნელობას
# ვისწავლეთ როგორ გამოვიყენოთ print ფუნქცია შედეგის გამოსატანად
# ასევე ვისწავლეთ როგორ დავურთოთ ერთმანეთს ტექსტები რასაც ეწოდება (კონკატინაცია)
