print("ჩემი საყვარელი ფერი არის: წითელი")
print("ჩემი საყვარელი საჭმელი არის: მწვადო")
print("ჩემი საყვარელი ჰობი არის: პროგრამირება")


movie1 = "Dexter morgan"
movie2 = "Bleach"
movie3 = "avatar"
movie4 = "one piece"
movie5 = "Walking dead dead city"


# კონკატინაცია ნიშნავს სტრინგების შეერთებას
# მაგალითად:
n = "საბა"
x = "16"
# ქვედა ხაზზე სტრინგებს ვაერთებთ ერთად + ნიშნის საშუალებით
print(n + " არის " + x + " წლის ")


# დღეს ვისწავლეთ შემდეგი მონაცემთა ტიპები:
# 1. string (ტექსტური მონაცემი) - ("მაგარი" + "ვარ")
# 2. integer (მთელი რიცხვი) - 5, 10, 2025
# 3. float (ათწილადი) - 3.14, 0.5


name = "ნიკოლოზი"
age = "12"
print("მე მქვია " + name + " და მე ვარ " + str(age) + " წლის " + " და " + " მე " + " ძალიან " + " მიყვარს " + " პროგრამირობა")