letters = ["ა", "ბ", "გ", "დ", "ე", "ვ", "ზ", "თ", "ი", "კ"]

print("პირველი 5 ასო:", letters[:5])     
print("ბოლო 3 ასო:", letters[-3:])       
print("უკუღმა:", letters[::-1])          
print("მე-2 დან მე-6-მდე:", letters[1:6])

# ------------------------------------------------

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]

print("თითოეული:", numbers[::2])   # თითოეული მეორე
print("ბოლო ოთხი:", numbers[:-5:-1])  # ბოლო 4 უკუღმა

# ------------------------------------------------

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]

print("თითოეული მეორე ელემენტი:", numbers[::2])   # თითოეული მეორე
print("ბოლო ოთხი ელემენტი უკუღმა:", numbers[:-5:-1])  # ბოლო 4 უკუღმა

# ------------------------------------------------

text = "დილამშვიდობისა"

print("დილა:", text[:4])         # პირველი 4 სიმბოლო
print("მშვიდობისა:", text[4:])   # დანარჩენი

# -----------------------------------------------------------